app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "lisa"], ["last_name", "bartasius"], ["created_at", "2021-01-18 15:30:46.640029"], ["updated_at", "2021-01-18 15:30:46.640029"]]
---
    def create
        @student = Student.new(student_params(:first_name, :last_name))
        @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Abbie"], ["last_name", "Coghlan"], ["updated_at", "2021-01-18 15:30:34.306685"], ["id", 1]]
---
    def update
        @student = Student.find(params[:id])
        @student.update(student_params(:first_name, :last_name))